local-setup/hey-tests/results/remote-two-raw-100-8000-16-07-23_03-09-51

Summary:
  Total:	1.7843 secs
  Slowest:	1.7837 secs
  Fastest:	1.6281 secs
  Average:	1.7153 secs
  Requests/sec:	56.0445
  
  Total data:	1700 bytes
  Size/request:	17 bytes

Response time histogram:
  1.628 [1]	|■■■
  1.644 [10]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.659 [7]	|■■■■■■■■■■■■■■■■■■■■
  1.675 [7]	|■■■■■■■■■■■■■■■■■■■■
  1.690 [2]	|■■■■■■
  1.706 [9]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.721 [11]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.737 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.753 [14]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.768 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.784 [14]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.6393 secs
  25% in 1.6805 secs
  50% in 1.7283 secs
  75% in 1.7563 secs
  90% in 1.7742 secs
  95% in 1.7793 secs
  99% in 1.7837 secs

Details (average, fastest, slowest):
  DNS+dialup:	1.1546 secs, 1.6281 secs, 1.7837 secs
  DNS-lookup:	0.1542 secs, 0.1398 secs, 0.1858 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.5605 secs, 0.1554 secs, 1.2212 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	100 responses



---


Summary:
  Total:	1.2005 secs
  Slowest:	1.1993 secs
  Fastest:	0.5800 secs
  Average:	0.8298 secs
  Requests/sec:	166.5925
  
  Total data:	3400 bytes
  Size/request:	17 bytes

Response time histogram:
  0.580 [1]	|■
  0.642 [31]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.704 [48]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.766 [13]	|■■■■■■■■■■■
  0.828 [16]	|■■■■■■■■■■■■■
  0.890 [17]	|■■■■■■■■■■■■■■
  0.952 [17]	|■■■■■■■■■■■■■■
  1.013 [12]	|■■■■■■■■■■
  1.075 [17]	|■■■■■■■■■■■■■■
  1.137 [13]	|■■■■■■■■■■■
  1.199 [15]	|■■■■■■■■■■■■■


Latency distribution:
  10% in 0.6370 secs
  25% in 0.6610 secs
  50% in 0.7792 secs
  75% in 0.9938 secs
  90% in 1.1209 secs
  95% in 1.1615 secs
  99% in 1.1992 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.4008 secs, 0.5800 secs, 1.1993 secs
  DNS-lookup:	0.1378 secs, 0.1018 secs, 0.1756 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.3773 secs, 0.1796 secs, 0.5886 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	200 responses



---


Summary:
  Total:	2.1855 secs
  Slowest:	2.1848 secs
  Fastest:	0.9321 secs
  Average:	1.4032 secs
  Requests/sec:	183.0205
  
  Total data:	6800 bytes
  Size/request:	17 bytes

Response time histogram:
  0.932 [1]	|
  1.057 [129]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.183 [30]	|■■■■■■■■■
  1.308 [31]	|■■■■■■■■■■
  1.433 [29]	|■■■■■■■■■
  1.558 [33]	|■■■■■■■■■■
  1.684 [28]	|■■■■■■■■■
  1.809 [30]	|■■■■■■■■■
  1.934 [31]	|■■■■■■■■■■
  2.060 [29]	|■■■■■■■■■
  2.185 [29]	|■■■■■■■■■


Latency distribution:
  10% in 0.9406 secs
  25% in 0.9966 secs
  50% in 1.3508 secs
  75% in 1.7492 secs
  90% in 2.0035 secs
  95% in 2.0911 secs
  99% in 2.1551 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.6698 secs, 0.9321 secs, 2.1848 secs
  DNS-lookup:	0.1780 secs, 0.1246 secs, 0.2046 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.7320 secs, 0.2681 secs, 1.2572 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	400 responses



---


Summary:
  Total:	4.1428 secs
  Slowest:	4.1418 secs
  Fastest:	1.5698 secs
  Average:	2.6966 secs
  Requests/sec:	193.1061
  
  Total data:	13600 bytes
  Size/request:	17 bytes

Response time histogram:
  1.570 [1]	|
  1.827 [55]	|■■■■■■■■■■
  2.084 [98]	|■■■■■■■■■■■■■■■■■■■
  2.341 [211]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.599 [64]	|■■■■■■■■■■■■
  2.856 [51]	|■■■■■■■■■■
  3.113 [67]	|■■■■■■■■■■■■■
  3.370 [65]	|■■■■■■■■■■■■
  3.627 [66]	|■■■■■■■■■■■■■
  3.885 [63]	|■■■■■■■■■■■■
  4.142 [59]	|■■■■■■■■■■■


Latency distribution:
  10% in 1.9195 secs
  25% in 2.1057 secs
  50% in 2.5186 secs
  75% in 3.3276 secs
  90% in 3.7997 secs
  95% in 3.9561 secs
  99% in 4.0889 secs

Details (average, fastest, slowest):
  DNS+dialup:	1.0147 secs, 1.5698 secs, 4.1418 secs
  DNS-lookup:	0.2831 secs, 0.1913 secs, 0.3347 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0010 secs
  resp wait:	1.4449 secs, 0.8516 secs, 2.3010 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	800 responses



---


Summary:
  Total:	4.8481 secs
  Slowest:	4.8470 secs
  Fastest:	1.7231 secs
  Average:	3.0116 secs
  Requests/sec:	206.2643
  
  Total data:	17000 bytes
  Size/request:	17 bytes

Response time histogram:
  1.723 [1]	|
  2.036 [116]	|■■■■■■■■■■■■■■■■■
  2.348 [269]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.660 [78]	|■■■■■■■■■■■■
  2.973 [76]	|■■■■■■■■■■■
  3.285 [80]	|■■■■■■■■■■■■
  3.597 [77]	|■■■■■■■■■■■
  3.910 [77]	|■■■■■■■■■■■
  4.222 [75]	|■■■■■■■■■■■
  4.535 [78]	|■■■■■■■■■■■■
  4.847 [73]	|■■■■■■■■■■■


Latency distribution:
  10% in 2.0101 secs
  25% in 2.1695 secs
  50% in 2.8069 secs
  75% in 3.8170 secs
  90% in 4.4412 secs
  95% in 4.6367 secs
  99% in 4.7942 secs

Details (average, fastest, slowest):
  DNS+dialup:	1.1265 secs, 1.7231 secs, 4.8470 secs
  DNS-lookup:	0.3038 secs, 0.2032 secs, 0.3384 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	1.7632 secs, 0.6304 secs, 3.0649 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1000 responses



---


Summary:
  Total:	10.1882 secs
  Slowest:	7.2778 secs
  Fastest:	0.4228 secs
  Average:	4.1999 secs
  Requests/sec:	196.3063
  
  Total data:	34000 bytes
  Size/request:	17 bytes

Response time histogram:
  0.423 [1]	|
  1.108 [196]	|■■■■■■■■■■■■■■■
  1.794 [359]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.479 [190]	|■■■■■■■■■■■■■■■
  3.165 [66]	|■■■■■
  3.850 [188]	|■■■■■■■■■■■■■■
  4.536 [103]	|■■■■■■■■
  5.221 [0]	|
  5.907 [11]	|■
  6.592 [367]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  7.278 [519]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.1218 secs
  25% in 1.7038 secs
  50% in 4.0333 secs
  75% in 6.6850 secs
  90% in 7.1567 secs
  95% in 7.2353 secs
  99% in 7.2605 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.4286 secs, 0.4228 secs, 7.2778 secs
  DNS-lookup:	0.0987 secs, 0.0000 secs, 0.2227 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0054 secs
  resp wait:	3.7332 secs, 0.4227 secs, 5.9813 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0017 secs

Status code distribution:
  [200]	2000 responses



---


Summary:
  Total:	20.5826 secs
  Slowest:	7.2047 secs
  Fastest:	0.1034 secs
  Average:	3.7101 secs
  Requests/sec:	194.3386
  
  Total data:	61030 bytes
  Size/request:	15 bytes

Response time histogram:
  0.103 [1]	|
  0.814 [107]	|■■
  1.524 [333]	|■■■■■■■
  2.234 [316]	|■■■■■■■
  2.944 [224]	|■■■■■
  3.654 [1868]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.364 [135]	|■■■
  5.074 [44]	|■
  5.784 [108]	|■■
  6.495 [446]	|■■■■■■■■■■
  7.205 [417]	|■■■■■■■■■


Latency distribution:
  10% in 1.4822 secs
  25% in 3.0368 secs
  50% in 3.3027 secs
  75% in 4.8398 secs
  90% in 6.7244 secs
  95% in 6.8898 secs
  99% in 7.0862 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.2101 secs, 0.1034 secs, 7.2047 secs
  DNS-lookup:	0.0528 secs, 0.0000 secs, 0.2399 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	3.4876 secs, 0.1032 secs, 5.8583 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	3590 responses
  [502]	409 responses

Error distribution:
  [1]	Get "https://two.standalone-lb.hosts.pve": context deadline exceeded (Client.Timeout exceeded while awaiting headers)



---


Summary:
  Total:	41.5427 secs
  Slowest:	9.9937 secs
  Fastest:	0.2001 secs
  Average:	3.6350 secs
  Requests/sec:	192.5730
  
  Total data:	127432 bytes
  Size/request:	15 bytes

Response time histogram:
  0.200 [1]	|
  1.180 [178]	|■■
  2.159 [686]	|■■■■■■■■■
  3.138 [1052]	|■■■■■■■■■■■■■
  4.118 [3224]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.097 [2742]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  6.076 [67]	|■
  7.056 [33]	|
  8.035 [14]	|
  9.014 [0]	|
  9.994 [1]	|


Latency distribution:
  10% in 2.0851 secs
  25% in 3.2049 secs
  50% in 3.8512 secs
  75% in 4.2446 secs
  90% in 4.4888 secs
  95% in 4.6121 secs
  99% in 5.3939 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.1298 secs, 0.2001 secs, 9.9937 secs
  DNS-lookup:	0.0556 secs, 0.0000 secs, 0.5451 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0044 secs
  resp wait:	3.4853 secs, 0.2000 secs, 9.9936 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	7496 responses
  [502]	502 responses

Error distribution:
  [2]	Get "https://two.standalone-lb.hosts.pve": context deadline exceeded (Client.Timeout exceeded while awaiting headers)



---